import { sortItems } from '../index'

describe('1203. 项目管理', () => {
    it('input: n = 8, m = 2, group = [-1,-1,1,0,0,1,0,-1], beforeItems = [[],[6],[5],[6],[3,6],[],[],[]], output: [6,3,4,1,5,2,0,7]', () => {
        expect(
            sortItems(8, 2, [-1, -1, 1, 0, 0, 1, 0, -1], [[], [6], [5], [6], [3, 6], [], [], []]),
        ).toEqual([6, 3, 4, 5, 2, 0, 7, 1])
    })

    it('input: n = 5, m = 5, group = [2,0,-1,3,0], beforeItems = [[2,1,3],[2,4],[],[],[]], output: [3,2,4,1,0]', () => {
        expect(sortItems(5, 5, [2, 0, -1, 3, 0], [[2, 1, 3], [2, 4], [], [], []])).toEqual([
            3,
            2,
            4,
            1,
            0,
        ])
    })
})
